{
	"title": "Node.Js Design Patterns - Second Edition",
	"authors": [
		"Mario Casciaro",
		"Luciano Mammino"
	],
	"publisher": "Packt Publishing",
	"description": "Get the best out of Node.js by mastering its most powerful components and patterns to create modular and scalable applications with easeAbout This Book- Create reusable patterns and modules by leveraging the new features of Node.js .- Understand the asynchronous single thread design of node and grasp all its features and patterns to take advantage of various functions.- This unique guide will help you get the most out of Node.js and its ecosystem.Who This Book Is ForThe book is meant for developers and software architects with a basic working knowledge of JavaScript who are interested in acquiring a deeper understanding of how to design and develop enterprise-level Node.js applications.Basic knowledge of Node.js is also helpful to get the most out of this book.What You Will Learn- Design and implement a series of server-side JavaScript patterns so you understand why and when to apply them in different use case scenarios- Become comfortable with writing asynchronous code by leveraging constructs such as callbacks, promises, generators and the async-await syntax- Identify the most important concerns and apply unique tricks to achieve higher scalability and modularity in your Node.js application- Untangle your modules by organizing and connecting them coherently- Reuse well-known techniques to solve common design and coding issues- Explore the latest trends in Universal JavaScript, learn how to write code that runs on both Node.js and the browser and leverage React and its ecosystem to implement universal applicationsIn DetailNode.js is a massively popular software platform that lets you use JavaScript to easily create scalable server-side applications. It allows you to create efficient code, enabling a more sustainable way of writing software made of only one language across the full stack, along with extreme levels of reusability, pragmatism, simplicity, and collaboration. Node.js is revolutionizing the web and the way people and companies create their software.In this book, we will take you on a journey across various ideas and components, and the challenges you would commonly encounter while designing and developing software using the Node.js platform. You will also discover the \"Node.js way\" of dealing with design and coding decisions.The book kicks off by exploring the basics of Node.js describing it's asynchronous single-threaded architecture and the main design patterns. It then shows you how to master the asynchronous control flow patterns,and the stream component and it culminates into a detailed list of Node.js implementations of the most common design patterns as well as some specific design patterns that are exclusive to the Node.js world.Lastly, it dives into more advanced concepts such as Universal Javascript, and scalability' and it's meant to conclude the journey by giving the reader all the necessary concepts to be able to build an enterprise grade application using Node.js.Style and approachThis book takes its intended readers through a comprehensive explanation to create a scalable and efficient real-time server-side apps."
}
